package 算法类.动态规划;

/**
 * Problem B: 争分夺秒
     黑魔法师魈狸施法将小行星改道意图撞向地球。嘉文皇子利用
     YOKONG 等离子巨炮将小行星打碎，但是仍有不少碎片越过大气层落
     入德玛西亚境内。最危急的是大量剧毒的碎片掉进了蜿蜒之河。嘉文
     皇子下令立刻打捞这些碎片。由于碎片太多和分散，打捞方案是在河
     道的 M 个地点利用傲之追猎者提供的网将流经的碎片全部拦截。
     碎片会以水流速(1 单位长度/秒)往下游流去，同时碎片的污染
     能力与他们的质量和在水中的时间成正比,为 1 粒度/(千克*秒)。假
     定拉网的位置只能设在整数单位长度点上。请你设计如何设置这 M 个
     打捞点使得总污染粒度最小。
     输入格式：输入包含多组数据，每组数据第一行数据是两个正整数 N（碎片个数）
     和 M（网的张数），其中 1≤N≤2000，2≤M≤20; 每组数据的第 i+1 行
     是两个整数 d i 和 w i 代表第 i 个碎片落水点的位移和碎片的重量
     (0≤d i ≤2 20 ，1≤w i ≤2 10 )，并且满足 0≤d 1 < d 2 <……< d N-1 < d N 。N=0 和 M=0
     表示输入结束。
     输出格式：按照输入的顺序，输出每组数据的总污染粒度的最小值。
     输入示例：
     4 2
     0 3
     1 2
     4 8
     7 1
     7 3
     0 3
     1 2
     2 8
     3 1
     4 3
     5 7
     6 4
     0 0
     输出示例：
     18
     13
 */
public class 某课程设计 {

    public static void main(String[] args) {

    }
}
